{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Localist_Concept_Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2810], "dtype": "float32", "sparse": false, "name": "Localist_Concept_Input"}, "inbound_nodes": []}, {"name": "Internal_Distributed_Concept_Representation", "class_name": "Dense", "config": {"name": "Internal_Distributed_Concept_Representation", "trainable": true, "batch_input_shape": [null, 2810], "dtype": "float32", "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Localist_Concept_Input", 0, 0, {}]]]}, {"name": "Localist_Relation_Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "name": "Localist_Relation_Input"}, "inbound_nodes": []}, {"name": "Internal_Distributed_Relation_Representation_Input", "class_name": "Concatenate", "config": {"name": "Internal_Distributed_Relation_Representation_Input", "trainable": true, "axis": -1}, "inbound_nodes": [[["Internal_Distributed_Concept_Representation", 0, 0, {}], ["Localist_Relation_Input", 0, 0, {}]]]}, {"name": "Internal_Distributed_Relation_Representation", "class_name": "Dense", "config": {"name": "Internal_Distributed_Relation_Representation", "trainable": true, "batch_input_shape": [null, 209], "dtype": "float32", "units": 400, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Internal_Distributed_Relation_Representation_Input", 0, 0, {}]]]}, {"name": "Dropout_Layer", "class_name": "Dropout", "config": {"name": "Dropout_Layer", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Internal_Distributed_Relation_Representation", 0, 0, {}]]]}, {"name": "Localist_Output_Representation", "class_name": "Dense", "config": {"name": "Localist_Output_Representation", "trainable": true, "units": 2810, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout_Layer", 0, 0, {}]]]}], "input_layers": [["Localist_Concept_Input", 0, 0], ["Localist_Relation_Input", 0, 0]], "output_layers": [["Localist_Output_Representation", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}